performance-tests/crud-result.txt

========================================
CRUD TEST - 1 VUs - 10s
Date: Thu Aug 13 01:49:02 PM IST 2026
========================================

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: crud-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 40s max duration (incl. graceful stop):
              * default: 1 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 1 VUs  01.0s/10s

running (02.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
default   [  20% ] 1 VUs  02.0s/10s

running (03.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
default   [  30% ] 1 VUs  03.0s/10s

running (04.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
default   [  40% ] 1 VUs  04.0s/10s

running (05.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
default   [  50% ] 1 VUs  05.0s/10s

running (06.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
default   [  60% ] 1 VUs  06.0s/10s

running (07.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
default   [  70% ] 1 VUs  07.0s/10s

running (08.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
default   [  80% ] 1 VUs  08.0s/10s

running (09.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
default   [  90% ] 1 VUs  09.0s/10s

running (10.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
default   [ 100% ] 1 VUs  10.0s/10s


  █ THRESHOLDS 

    create_task_duration
    ✓ 'p(95)<500' p(95)=11.315057

    delete_task_duration
    ✓ 'p(95)<500' p(95)=2.549914

    get_tasks_duration
    ✓ 'p(95)<500' p(95)=13.29783

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    update_task_duration
    ✓ 'p(95)<500' p(95)=3.582195


  █ TOTAL RESULTS 

    checks_total.......: 60      5.883656/s
    checks_succeeded...: 100.00% 60 out of 60
    checks_failed......: 0.00%   0 out of 60

    ✓ GET status is 200
    ✓ GET returned JSON
    ✓ POST status is successful
    ✓ POST returned JSON
    ✓ PUT status is successful
    ✓ DELETE status is successful

    CUSTOM
    create_task_duration...........: avg=8.728333 min=7.899111 med=8.136897 max=13.217243 p(90)=9.412872 p(95)=11.315057
    delete_task_duration...........: avg=2.148588 min=1.162738 med=2.220015 max=2.603378  p(90)=2.49645  p(95)=2.549914 
    get_tasks_duration.............: avg=4.247428 min=1.900695 med=2.249506 max=21.668489 p(90)=4.92717  p(95)=13.29783 
    update_task_duration...........: avg=3.121664 min=2.592311 med=3.050083 max=3.628919  p(90)=3.535472 p(95)=3.582195 

    HTTP
    http_req_duration..............: avg=4.56ms   min=1.16ms   med=2.85ms   max=21.66ms   p(90)=8.32ms   p(95)=9.2ms    
      { expected_response:true }...: avg=4.56ms   min=1.16ms   med=2.85ms   max=21.66ms   p(90)=8.32ms   p(95)=9.2ms    
    http_req_failed................: 0.00%  0 out of 40
    http_reqs......................: 40     3.922437/s

    EXECUTION
    iteration_duration.............: avg=1.01s    min=1.01s    med=1.01s    max=1.04s     p(90)=1.02s    p(95)=1.03s    
    iterations.....................: 10     0.980609/s
    vus............................: 1      min=1       max=1
    vus_max........................: 1      min=1       max=1

    NETWORK
    data_received..................: 19 kB  1.8 kB/s
    data_sent......................: 6.6 kB 650 B/s



running (10.2s), 0/1 VUs, 10 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  10s

========================================
CRUD TEST - 10 VUs - 30s
Date: Thu Aug 13 01:49:13 PM IST 2026
========================================

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: crud-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 10 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  01.0s/30s

running (0m02.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  02.0s/30s

running (0m03.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  03.0s/30s

running (0m04.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  04.0s/30s

running (0m05.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  05.0s/30s

running (0m06.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  06.0s/30s

running (0m07.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  07.0s/30s

running (0m08.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  08.0s/30s

running (0m09.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  09.0s/30s

running (0m10.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  10.0s/30s

running (0m11.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  11.0s/30s

running (0m12.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  12.0s/30s

running (0m13.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  13.0s/30s

running (0m14.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  14.0s/30s

running (0m15.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  15.0s/30s

running (0m16.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  16.0s/30s

running (0m16.2s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  16.2s/30s

running (0m16.5s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  16.5s/30s

running (0m17.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  17.0s/30s

running (0m18.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  18.0s/30s

running (0m19.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  19.0s/30s

running (0m20.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  20.0s/30s

running (0m21.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  21.0s/30s

running (0m22.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  22.0s/30s

running (0m23.0s), 10/10 VUs, 220 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  23.0s/30s

running (0m24.0s), 10/10 VUs, 230 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  24.0s/30s

running (0m25.0s), 10/10 VUs, 240 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  25.0s/30s

running (0m26.0s), 10/10 VUs, 250 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  26.0s/30s

running (0m27.0s), 10/10 VUs, 260 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  27.0s/30s

running (0m28.0s), 10/10 VUs, 270 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  28.0s/30s

running (0m29.0s), 10/10 VUs, 280 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  29.0s/30s

running (0m30.0s), 10/10 VUs, 290 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  30.0s/30s


  █ THRESHOLDS 

    create_task_duration
    ✓ 'p(95)<500' p(95)=10.826626

    delete_task_duration
    ✓ 'p(95)<500' p(95)=3.243364

    get_tasks_duration
    ✓ 'p(95)<500' p(95)=6.043134

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    update_task_duration
    ✓ 'p(95)<500' p(95)=4.929259


  █ TOTAL RESULTS 

    checks_total.......: 1800    58.985543/s
    checks_succeeded...: 100.00% 1800 out of 1800
    checks_failed......: 0.00%   0 out of 1800

    ✓ GET status is 200
    ✓ GET returned JSON
    ✓ POST status is successful
    ✓ POST returned JSON
    ✓ PUT status is successful
    ✓ DELETE status is successful

    CUSTOM
    create_task_duration...........: avg=7.300882 min=1.853808 med=7.754614 max=13.122709 p(90)=10.252912 p(95)=10.826626
    delete_task_duration...........: avg=1.850344 min=0.810914 med=1.724051 max=3.852419  p(90)=2.931246  p(95)=3.243364 
    get_tasks_duration.............: avg=3.980282 min=0.896006 med=3.811985 max=17.702579 p(90)=5.4083    p(95)=6.043134 
    update_task_duration...........: avg=3.069374 min=1.239165 med=2.890833 max=11.218327 p(90)=4.497933  p(95)=4.929259 

    HTTP
    http_req_duration..............: avg=4.05ms   min=810.91µs med=3.17ms   max=17.7ms    p(90)=8.71ms    p(95)=9.79ms   
      { expected_response:true }...: avg=4.05ms   min=810.91µs med=3.17ms   max=17.7ms    p(90)=8.71ms    p(95)=9.79ms   
    http_req_failed................: 0.00%  0 out of 1200
    http_reqs......................: 1200   39.323695/s

    EXECUTION
    iteration_duration.............: avg=1.01s    min=1s       med=1.01s    max=1.02s     p(90)=1.02s     p(95)=1.02s    
    iterations.....................: 300    9.830924/s
    vus............................: 10     min=10        max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 571 kB 19 kB/s
    data_sent......................: 201 kB 6.6 kB/s



running (0m30.5s), 00/10 VUs, 300 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  30s

========================================
CRUD TEST - 50 VUs - 30s
Date: Thu Aug 13 01:49:44 PM IST 2026
========================================

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: crud-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 50 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 50 VUs  01.0s/30s

running (0m02.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
default   [   7% ] 50 VUs  02.0s/30s

running (0m03.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  03.0s/30s

running (0m04.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
default   [  13% ] 50 VUs  04.0s/30s

running (0m05.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
default   [  17% ] 50 VUs  05.0s/30s

running (0m06.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  06.0s/30s

running (0m07.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
default   [  23% ] 50 VUs  07.0s/30s

running (0m08.0s), 50/50 VUs, 350 complete and 0 interrupted iterations
default   [  27% ] 50 VUs  08.0s/30s

running (0m09.0s), 50/50 VUs, 400 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  09.0s/30s

running (0m10.0s), 50/50 VUs, 450 complete and 0 interrupted iterations
default   [  33% ] 50 VUs  10.0s/30s

running (0m11.0s), 50/50 VUs, 500 complete and 0 interrupted iterations
default   [  37% ] 50 VUs  11.0s/30s

running (0m12.0s), 50/50 VUs, 550 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  12.0s/30s

running (0m13.0s), 50/50 VUs, 600 complete and 0 interrupted iterations
default   [  43% ] 50 VUs  13.0s/30s

running (0m14.0s), 50/50 VUs, 650 complete and 0 interrupted iterations
default   [  47% ] 50 VUs  14.0s/30s

running (0m15.0s), 50/50 VUs, 700 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  15.0s/30s

running (0m16.0s), 50/50 VUs, 750 complete and 0 interrupted iterations
default   [  53% ] 50 VUs  16.0s/30s

running (0m17.0s), 50/50 VUs, 800 complete and 0 interrupted iterations
default   [  57% ] 50 VUs  17.0s/30s

running (0m18.0s), 50/50 VUs, 850 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  18.0s/30s

running (0m19.0s), 50/50 VUs, 900 complete and 0 interrupted iterations
default   [  63% ] 50 VUs  19.0s/30s

running (0m20.0s), 50/50 VUs, 950 complete and 0 interrupted iterations
default   [  67% ] 50 VUs  20.0s/30s

running (0m21.0s), 50/50 VUs, 1000 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  21.0s/30s

running (0m22.0s), 50/50 VUs, 1050 complete and 0 interrupted iterations
default   [  73% ] 50 VUs  22.0s/30s

running (0m23.0s), 50/50 VUs, 1100 complete and 0 interrupted iterations
default   [  77% ] 50 VUs  23.0s/30s

running (0m24.0s), 50/50 VUs, 1150 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  24.0s/30s

running (0m25.0s), 50/50 VUs, 1200 complete and 0 interrupted iterations
default   [  83% ] 50 VUs  25.0s/30s

running (0m26.0s), 50/50 VUs, 1250 complete and 0 interrupted iterations
default   [  87% ] 50 VUs  26.0s/30s

running (0m27.0s), 50/50 VUs, 1300 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  27.0s/30s

running (0m28.0s), 50/50 VUs, 1350 complete and 0 interrupted iterations
default   [  93% ] 50 VUs  28.0s/30s

running (0m29.0s), 50/50 VUs, 1400 complete and 0 interrupted iterations
default   [  97% ] 50 VUs  29.0s/30s

running (0m30.0s), 50/50 VUs, 1450 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  30.0s/30s


  █ THRESHOLDS 

    create_task_duration
    ✓ 'p(95)<500' p(95)=11.601855

    delete_task_duration
    ✓ 'p(95)<500' p(95)=8.238926

    get_tasks_duration
    ✓ 'p(95)<500' p(95)=12.488235

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    update_task_duration
    ✓ 'p(95)<500' p(95)=10.413853


  █ TOTAL RESULTS 

    checks_total.......: 9000    294.058878/s
    checks_succeeded...: 100.00% 9000 out of 9000
    checks_failed......: 0.00%   0 out of 9000

    ✓ GET status is 200
    ✓ GET returned JSON
    ✓ POST status is successful
    ✓ POST returned JSON
    ✓ PUT status is successful
    ✓ DELETE status is successful

    CUSTOM
    create_task_duration...........: avg=5.880368 min=0.546498 med=5.918311 max=16.985691 p(90)=9.772364 p(95)=11.601855
    delete_task_duration...........: avg=3.842816 min=0.488783 med=3.498811 max=15.107522 p(90)=6.739086 p(95)=8.238926 
    get_tasks_duration.............: avg=4.617409 min=0.270841 med=3.394337 max=43.603993 p(90)=8.873469 p(95)=12.488235
    update_task_duration...........: avg=4.842444 min=0.504535 med=4.559881 max=15.459308 p(90)=8.815252 p(95)=10.413853

    HTTP
    http_req_duration..............: avg=4.79ms   min=270.84µs med=4.19ms   max=43.6ms    p(90)=8.81ms   p(95)=10.51ms  
      { expected_response:true }...: avg=4.79ms   min=270.84µs med=4.19ms   max=43.6ms    p(90)=8.81ms   p(95)=10.51ms  
    http_req_failed................: 0.00%  0 out of 6000
    http_reqs......................: 6000   196.039252/s

    EXECUTION
    iteration_duration.............: avg=1.01s    min=1s       med=1.01s    max=1.04s     p(90)=1.03s    p(95)=1.03s    
    iterations.....................: 1500   49.009813/s
    vus............................: 50     min=50        max=50
    vus_max........................: 50     min=50        max=50

    NETWORK
    data_received..................: 4.9 MB 159 kB/s
    data_sent......................: 1.0 MB 33 kB/s



running (0m30.6s), 00/50 VUs, 1500 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  30s

========================================
CRUD TEST - 100 VUs - 30s
Date: Thu Aug 13 01:50:15 PM IST 2026
========================================

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: crud-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 100 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 100 VUs  01.0s/30s

running (0m02.0s), 100/100 VUs, 100 complete and 0 interrupted iterations
default   [   7% ] 100 VUs  02.0s/30s

running (0m03.0s), 100/100 VUs, 200 complete and 0 interrupted iterations
default   [  10% ] 100 VUs  03.0s/30s

running (0m04.0s), 100/100 VUs, 300 complete and 0 interrupted iterations
default   [  13% ] 100 VUs  04.0s/30s

running (0m05.0s), 100/100 VUs, 400 complete and 0 interrupted iterations
default   [  17% ] 100 VUs  05.0s/30s

running (0m06.0s), 100/100 VUs, 500 complete and 0 interrupted iterations
default   [  20% ] 100 VUs  06.0s/30s

running (0m07.0s), 100/100 VUs, 600 complete and 0 interrupted iterations
default   [  23% ] 100 VUs  07.0s/30s

running (0m08.0s), 100/100 VUs, 700 complete and 0 interrupted iterations
default   [  27% ] 100 VUs  08.0s/30s

running (0m09.0s), 100/100 VUs, 800 complete and 0 interrupted iterations
default   [  30% ] 100 VUs  09.0s/30s

running (0m10.0s), 100/100 VUs, 900 complete and 0 interrupted iterations
default   [  33% ] 100 VUs  10.0s/30s

running (0m11.0s), 100/100 VUs, 1000 complete and 0 interrupted iterations
default   [  37% ] 100 VUs  11.0s/30s

running (0m12.0s), 100/100 VUs, 1100 complete and 0 interrupted iterations
default   [  40% ] 100 VUs  12.0s/30s

running (0m13.0s), 100/100 VUs, 1200 complete and 0 interrupted iterations
default   [  43% ] 100 VUs  13.0s/30s

running (0m14.0s), 100/100 VUs, 1300 complete and 0 interrupted iterations
default   [  47% ] 100 VUs  14.0s/30s

running (0m15.0s), 100/100 VUs, 1400 complete and 0 interrupted iterations
default   [  50% ] 100 VUs  15.0s/30s

running (0m16.0s), 100/100 VUs, 1500 complete and 0 interrupted iterations
default   [  53% ] 100 VUs  16.0s/30s

running (0m17.0s), 100/100 VUs, 1600 complete and 0 interrupted iterations
default   [  57% ] 100 VUs  17.0s/30s

running (0m18.0s), 100/100 VUs, 1700 complete and 0 interrupted iterations
default   [  60% ] 100 VUs  18.0s/30s

running (0m19.0s), 100/100 VUs, 1800 complete and 0 interrupted iterations
default   [  63% ] 100 VUs  19.0s/30s

running (0m20.0s), 100/100 VUs, 1900 complete and 0 interrupted iterations
default   [  67% ] 100 VUs  20.0s/30s

running (0m21.0s), 100/100 VUs, 2000 complete and 0 interrupted iterations
default   [  70% ] 100 VUs  21.0s/30s

running (0m22.0s), 100/100 VUs, 2100 complete and 0 interrupted iterations
default   [  73% ] 100 VUs  22.0s/30s

running (0m23.0s), 100/100 VUs, 2200 complete and 0 interrupted iterations
default   [  77% ] 100 VUs  23.0s/30s

running (0m24.0s), 100/100 VUs, 2300 complete and 0 interrupted iterations
default   [  80% ] 100 VUs  24.0s/30s

running (0m25.0s), 100/100 VUs, 2400 complete and 0 interrupted iterations
default   [  83% ] 100 VUs  25.0s/30s

running (0m26.0s), 100/100 VUs, 2500 complete and 0 interrupted iterations
default   [  87% ] 100 VUs  26.0s/30s

running (0m27.0s), 100/100 VUs, 2600 complete and 0 interrupted iterations
default   [  90% ] 100 VUs  27.0s/30s

running (0m28.0s), 100/100 VUs, 2700 complete and 0 interrupted iterations
default   [  93% ] 100 VUs  28.0s/30s

running (0m29.0s), 100/100 VUs, 2800 complete and 0 interrupted iterations
default   [  97% ] 100 VUs  29.0s/30s

running (0m30.0s), 100/100 VUs, 2900 complete and 0 interrupted iterations
default   [ 100% ] 100 VUs  30.0s/30s


  █ THRESHOLDS 

    create_task_duration
    ✓ 'p(95)<500' p(95)=10.446949

    delete_task_duration
    ✓ 'p(95)<500' p(95)=10.364757

    get_tasks_duration
    ✓ 'p(95)<500' p(95)=11.100428

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    update_task_duration
    ✓ 'p(95)<500' p(95)=10.998517


  █ TOTAL RESULTS 

    checks_total.......: 18000   588.598581/s
    checks_succeeded...: 100.00% 18000 out of 18000
    checks_failed......: 0.00%   0 out of 18000

    ✓ GET status is 200
    ✓ GET returned JSON
    ✓ POST status is successful
    ✓ POST returned JSON
    ✓ PUT status is successful
    ✓ DELETE status is successful

    CUSTOM
    create_task_duration...........: avg=4.426398 min=0.444798 med=3.631524 max=25.302174  p(90)=9.178536 p(95)=10.446949
    delete_task_duration...........: avg=3.495978 min=0.422683 med=2.363067 max=25.751188  p(90)=7.959105 p(95)=10.364757
    get_tasks_duration.............: avg=5.816371 min=0.167102 med=1.931945 max=139.033901 p(90)=8.902815 p(95)=11.100428
    update_task_duration...........: avg=4.040862 min=0.451194 med=3.076558 max=25.030709  p(90)=8.638254 p(95)=10.998517

    HTTP
    http_req_duration..............: avg=4.44ms   min=167.1µs  med=2.67ms   max=139.03ms   p(90)=8.77ms   p(95)=10.64ms  
      { expected_response:true }...: avg=4.44ms   min=167.1µs  med=2.67ms   max=139.03ms   p(90)=8.77ms   p(95)=10.64ms  
    http_req_failed................: 0.00%  0 out of 12000
    http_reqs......................: 12000  392.399054/s

    EXECUTION
    iteration_duration.............: avg=1.01s    min=1s       med=1.01s    max=1.14s      p(90)=1.03s    p(95)=1.04s    
    iterations.....................: 3000   98.099763/s
    vus............................: 100    min=100        max=100
    vus_max........................: 100    min=100        max=100

    NETWORK
    data_received..................: 11 MB  348 kB/s
    data_sent......................: 2.0 MB 66 kB/s



running (0m30.6s), 000/100 VUs, 3000 complete and 0 interrupted iterations
default ✓ [ 100% ] 100 VUs  30s

========================================
CRUD TEST - 500 VUs - 30s
Date: Thu Aug 13 01:50:46 PM IST 2026
========================================

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: crud-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 500 looping VUs for 30s (gracefulStop: 30s)


running (0m00.9s), 500/500 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 500 VUs  00.9s/30s

running (0m01.9s), 500/500 VUs, 500 complete and 0 interrupted iterations
default   [   6% ] 500 VUs  01.9s/30s

running (0m02.9s), 500/500 VUs, 1000 complete and 0 interrupted iterations
default   [  10% ] 500 VUs  02.9s/30s

running (0m03.9s), 500/500 VUs, 1500 complete and 0 interrupted iterations
default   [  13% ] 500 VUs  03.9s/30s

running (0m04.9s), 500/500 VUs, 2000 complete and 0 interrupted iterations
default   [  16% ] 500 VUs  04.9s/30s

running (0m05.9s), 500/500 VUs, 2500 complete and 0 interrupted iterations
default   [  20% ] 500 VUs  05.9s/30s

running (0m06.9s), 500/500 VUs, 3000 complete and 0 interrupted iterations
default   [  23% ] 500 VUs  06.9s/30s

running (0m07.9s), 500/500 VUs, 3500 complete and 0 interrupted iterations
default   [  26% ] 500 VUs  07.9s/30s

running (0m08.9s), 500/500 VUs, 4000 complete and 0 interrupted iterations
default   [  30% ] 500 VUs  08.9s/30s

running (0m09.9s), 500/500 VUs, 4500 complete and 0 interrupted iterations
default   [  33% ] 500 VUs  09.9s/30s

running (0m10.9s), 500/500 VUs, 5000 complete and 0 interrupted iterations
default   [  36% ] 500 VUs  10.9s/30s
time="2026-08-13T13:50:57+05:30" level=warning msg="The test has generated metrics with 101284 unique time series, which is higher than the suggested limit of 100000 and could cause high memory usage. Consider not using high-cardinality values like unique IDs as metric tags or, if you need them in the URL, use the name metric tag or URL grouping. See https://grafana.com/docs/k6/latest/using-k6/tags-and-groups/ for details." component=metrics-engine-ingester

running (0m11.9s), 500/500 VUs, 5500 complete and 0 interrupted iterations
default   [  40% ] 500 VUs  11.9s/30s

running (0m12.9s), 500/500 VUs, 6000 complete and 0 interrupted iterations
default   [  43% ] 500 VUs  12.9s/30s

running (0m13.9s), 500/500 VUs, 6500 complete and 0 interrupted iterations
default   [  46% ] 500 VUs  13.9s/30s

running (0m14.9s), 500/500 VUs, 7000 complete and 0 interrupted iterations
default   [  50% ] 500 VUs  14.9s/30s

running (0m15.9s), 500/500 VUs, 7500 complete and 0 interrupted iterations
default   [  53% ] 500 VUs  15.9s/30s

running (0m16.9s), 500/500 VUs, 8000 complete and 0 interrupted iterations
default   [  56% ] 500 VUs  16.9s/30s

running (0m17.9s), 500/500 VUs, 8500 complete and 0 interrupted iterations
default   [  60% ] 500 VUs  17.9s/30s

running (0m18.9s), 500/500 VUs, 9000 complete and 0 interrupted iterations
default   [  63% ] 500 VUs  18.9s/30s

running (0m19.9s), 500/500 VUs, 9500 complete and 0 interrupted iterations
default   [  66% ] 500 VUs  19.9s/30s

running (0m20.9s), 500/500 VUs, 10000 complete and 0 interrupted iterations
default   [  70% ] 500 VUs  20.9s/30s

running (0m21.9s), 500/500 VUs, 10500 complete and 0 interrupted iterations
default   [  73% ] 500 VUs  21.9s/30s
time="2026-08-13T13:51:08+05:30" level=warning msg="The test has generated metrics with 200086 unique time series, which is higher than the suggested limit of 100000 and could cause high memory usage. Consider not using high-cardinality values like unique IDs as metric tags or, if you need them in the URL, use the name metric tag or URL grouping. See https://grafana.com/docs/k6/latest/using-k6/tags-and-groups/ for details." component=metrics-engine-ingester

running (0m22.9s), 500/500 VUs, 11000 complete and 0 interrupted iterations
default   [  76% ] 500 VUs  22.9s/30s

running (0m23.9s), 500/500 VUs, 11500 complete and 0 interrupted iterations
default   [  80% ] 500 VUs  23.9s/30s

running (0m24.9s), 500/500 VUs, 12000 complete and 0 interrupted iterations
default   [  83% ] 500 VUs  24.9s/30s

running (0m25.9s), 500/500 VUs, 12500 complete and 0 interrupted iterations
default   [  86% ] 500 VUs  25.9s/30s

running (0m26.9s), 500/500 VUs, 13000 complete and 0 interrupted iterations
default   [  90% ] 500 VUs  26.9s/30s

running (0m27.9s), 500/500 VUs, 13500 complete and 0 interrupted iterations
default   [  93% ] 500 VUs  27.9s/30s

running (0m28.9s), 500/500 VUs, 14000 complete and 0 interrupted iterations
default   [  96% ] 500 VUs  28.9s/30s

running (0m29.9s), 500/500 VUs, 14500 complete and 0 interrupted iterations
default   [ 100% ] 500 VUs  29.9s/30s


  █ THRESHOLDS 

    create_task_duration
    ✓ 'p(95)<500' p(95)=12.819414

    delete_task_duration
    ✓ 'p(95)<500' p(95)=12.040229

    get_tasks_duration
    ✓ 'p(95)<500' p(95)=19.945908

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    update_task_duration
    ✓ 'p(95)<500' p(95)=12.584379


  █ TOTAL RESULTS 

    checks_total.......: 90000   2915.595844/s
    checks_succeeded...: 100.00% 90000 out of 90000
    checks_failed......: 0.00%   0 out of 90000

    ✓ GET status is 200
    ✓ GET returned JSON
    ✓ POST status is successful
    ✓ POST returned JSON
    ✓ PUT status is successful
    ✓ DELETE status is successful

    CUSTOM
    create_task_duration...........: avg=3.252145  min=0.417975 med=1.246603 max=40.797649  p(90)=7.959817  p(95)=12.819414
    delete_task_duration...........: avg=2.879305  min=0.391573 med=1.11745  max=39.265183  p(90)=6.931051  p(95)=12.040229
    get_tasks_duration.............: avg=11.836407 min=0.147466 med=0.612356 max=497.339481 p(90)=10.289383 p(95)=19.945908
    update_task_duration...........: avg=3.128059  min=0.430825 med=1.213119 max=41.204229  p(90)=7.356886  p(95)=12.584379

    HTTP
    http_req_duration..............: avg=5.27ms    min=147.46µs med=1.08ms   max=497.33ms   p(90)=8.01ms    p(95)=13.95ms  
      { expected_response:true }...: avg=5.27ms    min=147.46µs med=1.08ms   max=497.33ms   p(90)=8.01ms    p(95)=13.95ms  
    http_req_failed................: 0.00% 0 out of 60000
    http_reqs......................: 60000 1943.730563/s

    EXECUTION
    iteration_duration.............: avg=1.02s     min=1s       med=1s       max=1.54s      p(90)=1.04s     p(95)=1.08s    
    iterations.....................: 15000 485.932641/s
    vus............................: 500   min=500        max=500
    vus_max........................: 500   min=500        max=500

    NETWORK
    data_received..................: 51 MB 1.7 MB/s
    data_sent......................: 10 MB 330 kB/s



running (0m30.9s), 000/500 VUs, 15000 complete and 0 interrupted iterations
default ✓ [ 100% ] 500 VUs  30s

========================================
CRUD TEST - 1000 VUs - 30s
Date: Thu Aug 13 01:51:17 PM IST 2026
========================================

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: crud-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 1000 looping VUs for 30s (gracefulStop: 30s)


running (0m00.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 1000 VUs  00.9s/30s

running (0m01.9s), 1000/1000 VUs, 727 complete and 0 interrupted iterations
default   [   6% ] 1000 VUs  01.9s/30s

running (0m02.9s), 1000/1000 VUs, 1059 complete and 0 interrupted iterations
default   [  10% ] 1000 VUs  02.9s/30s

running (0m03.9s), 1000/1000 VUs, 1137 complete and 0 interrupted iterations
default   [  13% ] 1000 VUs  03.9s/30s

running (0m04.9s), 1000/1000 VUs, 1330 complete and 0 interrupted iterations
default   [  16% ] 1000 VUs  04.9s/30s

running (0m05.9s), 1000/1000 VUs, 2324 complete and 0 interrupted iterations
default   [  20% ] 1000 VUs  05.9s/30s

running (0m06.9s), 1000/1000 VUs, 2441 complete and 0 interrupted iterations
default   [  23% ] 1000 VUs  06.9s/30s

running (0m07.9s), 1000/1000 VUs, 2612 complete and 0 interrupted iterations
default   [  26% ] 1000 VUs  07.9s/30s

running (0m08.9s), 1000/1000 VUs, 3612 complete and 0 interrupted iterations
default   [  30% ] 1000 VUs  08.9s/30s

running (0m09.9s), 1000/1000 VUs, 4042 complete and 0 interrupted iterations
default   [  33% ] 1000 VUs  09.9s/30s
time="2026-08-13T13:51:28+05:30" level=warning msg="The test has generated metrics with 102679 unique time series, which is higher than the suggested limit of 100000 and could cause high memory usage. Consider not using high-cardinality values like unique IDs as metric tags or, if you need them in the URL, use the name metric tag or URL grouping. See https://grafana.com/docs/k6/latest/using-k6/tags-and-groups/ for details." component=metrics-engine-ingester

running (0m10.9s), 1000/1000 VUs, 5042 complete and 0 interrupted iterations
default   [  36% ] 1000 VUs  10.9s/30s

running (0m11.9s), 1000/1000 VUs, 5716 complete and 0 interrupted iterations
default   [  40% ] 1000 VUs  11.9s/30s

running (0m12.9s), 1000/1000 VUs, 6679 complete and 0 interrupted iterations
default   [  43% ] 1000 VUs  12.9s/30s

running (0m13.9s), 1000/1000 VUs, 7654 complete and 0 interrupted iterations
default   [  46% ] 1000 VUs  13.9s/30s

running (0m14.9s), 1000/1000 VUs, 8644 complete and 0 interrupted iterations
default   [  50% ] 1000 VUs  14.9s/30s

running (0m15.9s), 1000/1000 VUs, 9286 complete and 0 interrupted iterations
default   [  53% ] 1000 VUs  15.9s/30s

running (0m16.9s), 1000/1000 VUs, 9711 complete and 0 interrupted iterations
default   [  56% ] 1000 VUs  16.9s/30s

running (0m17.9s), 1000/1000 VUs, 9984 complete and 0 interrupted iterations
default   [  60% ] 1000 VUs  17.9s/30s

running (0m18.9s), 1000/1000 VUs, 10362 complete and 0 interrupted iterations
default   [  63% ] 1000 VUs  18.9s/30s
time="2026-08-13T13:51:36+05:30" level=warning msg="The test has generated metrics with 200788 unique time series, which is higher than the suggested limit of 100000 and could cause high memory usage. Consider not using high-cardinality values like unique IDs as metric tags or, if you need them in the URL, use the name metric tag or URL grouping. See https://grafana.com/docs/k6/latest/using-k6/tags-and-groups/ for details." component=metrics-engine-ingester

running (0m19.9s), 1000/1000 VUs, 11120 complete and 0 interrupted iterations
default   [  66% ] 1000 VUs  19.9s/30s

running (0m20.9s), 1000/1000 VUs, 12035 complete and 0 interrupted iterations
default   [  70% ] 1000 VUs  20.9s/30s

running (0m21.9s), 1000/1000 VUs, 13008 complete and 0 interrupted iterations
default   [  73% ] 1000 VUs  21.9s/30s

running (0m22.9s), 1000/1000 VUs, 13980 complete and 0 interrupted iterations
default   [  76% ] 1000 VUs  22.9s/30s

running (0m23.9s), 1000/1000 VUs, 14976 complete and 0 interrupted iterations
default   [  80% ] 1000 VUs  23.9s/30s

running (0m24.9s), 1000/1000 VUs, 15973 complete and 0 interrupted iterations
default   [  83% ] 1000 VUs  24.9s/30s

running (0m25.9s), 1000/1000 VUs, 16485 complete and 0 interrupted iterations
default   [  86% ] 1000 VUs  25.9s/30s

running (0m26.9s), 1000/1000 VUs, 17010 complete and 0 interrupted iterations
default   [  90% ] 1000 VUs  26.9s/30s

running (0m27.9s), 1000/1000 VUs, 17606 complete and 0 interrupted iterations
default   [  93% ] 1000 VUs  27.9s/30s

running (0m28.9s), 1000/1000 VUs, 18606 complete and 0 interrupted iterations
default   [  96% ] 1000 VUs  28.9s/30s

running (0m29.9s), 1000/1000 VUs, 19606 complete and 0 interrupted iterations
default   [ 100% ] 1000 VUs  29.9s/30s

running (0m30.9s), 0032/1000 VUs, 20606 complete and 0 interrupted iterations
default ↓ [ 100% ] 1000 VUs  30s


  █ THRESHOLDS 

    create_task_duration
    ✗ 'p(95)<500' p(95)=615.224706

    delete_task_duration
    ✗ 'p(95)<500' p(95)=549.407232

    get_tasks_duration
    ✗ 'p(95)<500' p(95)=549.895136

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    update_task_duration
    ✗ 'p(95)<500' p(95)=591.2206


  █ TOTAL RESULTS 

    checks_total.......: 123828  3994.053417/s
    checks_succeeded...: 100.00% 123828 out of 123828
    checks_failed......: 0.00%   0 out of 123828

    ✓ GET status is 200
    ✓ GET returned JSON
    ✓ POST status is successful
    ✓ POST returned JSON
    ✓ PUT status is successful
    ✓ DELETE status is successful

    CUSTOM
    create_task_duration...........: avg=121.524503 min=0.423013 med=15.995362 max=1207.056313 p(90)=405.025245 p(95)=615.224706
    delete_task_duration...........: avg=102.754619 min=0.402774 med=12.799538 max=1205.690819 p(90)=291.105426 p(95)=549.407232
    get_tasks_duration.............: avg=115.020218 min=0.172168 med=16.402791 max=1207.309737 p(90)=353.234951 p(95)=549.895136
    update_task_duration...........: avg=119.938403 min=0.423922 med=14.243176 max=1209.721561 p(90)=393.528236 p(95)=591.2206  

    HTTP
    http_req_duration..............: avg=114.8ms    min=172.16µs med=14.82ms   max=1.2s        p(90)=350.49ms   p(95)=580.19ms  
      { expected_response:true }...: avg=114.8ms    min=172.16µs med=14.82ms   max=1.2s        p(90)=350.49ms   p(95)=580.19ms  
    http_req_failed................: 0.00%  0 out of 82552
    http_reqs......................: 82552  2662.702278/s

    EXECUTION
    iteration_duration.............: avg=1.47s      min=1s       med=1.13s     max=5.15s       p(90)=2.78s      p(95)=2.98s     
    iterations.....................: 20638  665.67557/s
    vus............................: 32     min=32         max=1000
    vus_max........................: 1000   min=1000       max=1000

    NETWORK
    data_received..................: 454 MB 15 MB/s
    data_sent......................: 14 MB  452 kB/s



running (0m31.0s), 0000/1000 VUs, 20638 complete and 0 interrupted iterations
default ✓ [ 100% ] 1000 VUs  30s
time="2026-08-13T13:51:49+05:30" level=error msg="thresholds on metrics 'create_task_duration, delete_task_duration, get_tasks_duration, update_task_duration' have been crossed"